#Требуется найти в массиве A[1..N] самый близкий по величине элемент 
#к заданному числу X. Пользователь в первой строке вводит 
#натуральное число N – количество элементов в массиве.
#В последующих строках записаны N целых чисел Ai. 
#Последняя строка содержит число X.
#Пример
#5
#1 2 3 4 5
#6
#-> 5
N = abs(int(input('Введите количество элементов списка А: ')))
A = input("Введите через пробел элементы списка: ").split()
B = list(map(int, A))
if len(B) != N or N == 0:
    print('Введенные элементы не соответствуют заявленному количеству!')
else:
    X = int(input('Введите число X, с которым необходимо сравнивать элементы списка: '))
    min = abs(X - B[0])
    index = 0
    for i in range(1, N):
        count = abs(X - B[i])
        if count < min:
            min = count
            index = i
    print(f'Число {B[index]} в списке A наиболее близко по величине к числу {X}, их разница составляет {abs(X - B[index])}')